tristar-multicopters/MotorControl/src/GNR2_Firmware/revA/grn2_ra6t2_ftexboard/FTEX/src/application_motor/mc_tasks.c
/**
 * @file  mc_tasks.c
 * @brief This file implements motor tasks definition
 *
 */

/* Includes ------------------------------------------------------------------*/
#include "gnr_main.h"
#include "mc_type.h"
#include "mc_math.h"
#include "regular_conversion_manager.h"
#include "mc_interface.h"
#include "mc_tuning.h"
#include "mc_state_machine.h"
#include "pwm_common.h"
#include "board_hardware.h"
#include "uCAL_GPIO.h"
#include "log_high_speed.h"
#include "comm_config.h" // For dual

#include "mc_tasks.h"
#include "motor_parameters.h"
#include "gnr_parameters.h"
#include "vc_autodetermination.h"
#include "motor_signal_processing.h"

#if AUTOTUNE_ENABLE
#include "r_aid_auto_identify.h"
#include "r_aid_driver_if.h"
#include "r_aid_core.h"
#include "autotune.h"
AutoTune_Handle_t pAutoTune;
void MCTask_InitTuning();
bool MC_UpdateMotorTunerOutput(float fBatteryVoltage);
void MC_ConfigureMotorTuner(void);
#endif

/* Private define ------------------------------------------------------------*/

#define CHARGE_BOOT_CAP_MS 10
#define CHARGE_BOOT_CAP_MS2 10
#define OFFCALIBRWAIT_MS 0
#define OFFCALIBRWAIT_MS2 0
#define STOPPERMANENCY_MS 10
#define STOPPERMANENCY_MS2 10
#define CHARGE_BOOT_CAP_TICKS (uint16_t)((SYS_TICK_FREQUENCY * CHARGE_BOOT_CAP_MS) / 1000)
#define CHARGE_BOOT_CAP_TICKS2 (uint16_t)((SYS_TICK_FREQUENCY * CHARGE_BOOT_CAP_MS2) / 1000)
#define OFFCALIBRWAITTICKS (uint16_t)((SYS_TICK_FREQUENCY * OFFCALIBRWAIT_MS) / 1000)
#define OFFCALIBRWAITTICKS2 (uint16_t)((SYS_TICK_FREQUENCY * OFFCALIBRWAIT_MS2) / 1000)
#define STOPPERMANENCY_TICKS (uint16_t)((SYS_TICK_FREQUENCY * STOPPERMANENCY_MS) / 1000)
#define STOPPERMANENCY_TICKS2 (uint16_t)((SYS_TICK_FREQUENCY * STOPPERMANENCY_MS2) / 1000)
#define VBUS_TEMP_ERR_MASK (uint32_t) ~(0 | MC_NO_FAULT)
#define DEFAULT_TEMP_MOTOR 0xFFF
#define DEFAULT_TEMP_CONTROLLER 0x000
#if OCDX_POEG == OCD1_POEG
    #define OCD2_MAX 4
#elif OCDX_POEG == OCD2_POEG
    #define OCD2_MAX 7
#endif
#define OCD2_TRIGGER_ERROR 3
#define OCD2_CHECK_RESET 10000 //~10 secs
#define DRIVER_TIMER 10000 //~.5 secs

/* Private variables----------------------------------------------------------*/
FOCVars_t FOCVars[NBR_OF_MOTORS];
MotorControlInterfaceHandle_t *oMCInterface[NBR_OF_MOTORS];
MotorControlInterfaceHandle_t MCInterface[NBR_OF_MOTORS];
MotorControlTuningHandle_t MCTuning[NBR_OF_MOTORS];
MotorStateMachineHandle_t MCStateMachine[NBR_OF_MOTORS];
SpdTorqCtrlHandle_t *pSpeedTorqCtrl[NBR_OF_MOTORS];
PIDHandle_t *pPIDSpeed[NBR_OF_MOTORS];
PIDHandle_t *pPIDIq[NBR_OF_MOTORS];
PIDHandle_t *pPIDId[NBR_OF_MOTORS];
ResDivVbusSensorHandle_t *pBusSensorM1;

NTCTempSensorHandle_t *pTemperatureSensorController[NBR_OF_MOTORS];
NTCTempSensorHandle_t *pTemperatureSensorMotor[NBR_OF_MOTORS];
PWMCurrFdbkHandle_t *pPWMCurrFdbk[NBR_OF_MOTORS];
MotorPowerQDHandle_t *pMotorPower[NBR_OF_MOTORS];
CircleLimitationHandle_t *pCircleLimitation[NBR_OF_MOTORS];
MCConfigHandle_t *pFieldWeakening[NBR_OF_MOTORS];
FeedforwardHandle_t *pFeedforward[NBR_OF_MOTORS];


static volatile uint16_t hMFTaskCounterM1 = 0;
static volatile uint16_t hBootCapDelayCounterM1 = 0;
static volatile uint16_t hStopPermanencyCounterM1 = 0;
volatile uint8_t bOCCheck = 0;
volatile uint16_t bOCNumOccur = 0;
volatile uint16_t hOCCheckReset = 0;
volatile uint16_t hDriverCounter = 0;
uint8_t bMCBootCompleted = 0;

#if DEBUGMODE_MOTOR_CONTROL
bool bStartMotor = false;
int16_t hTorqueFinalValueTest = 0;
#endif
#if (BYPASS_POSITION_SENSOR || BYPASS_CURRENT_CONTROL)
int16_t hOpenloopTheta = 0;
int16_t hOpenloopSpeed = -10;
#endif

/* Private functions ---------------------------------------------------------*/
void MediumFrequencyTaskM1(void);
void FOC_Clear(uint8_t bMotor);
void FOC_UpdatePIDGains(uint8_t bMotor);
void FOC_InitAdditionalMethods(uint8_t bMotor);
void FOC_CalcCurrRef(uint8_t bMotor);
static uint32_t FOC_CurrControllerM1(void);
void SetChargeBootCapDelayM1(uint16_t hTickCount);
bool ChargeBootCapDelayHasElapsedM1(void);
void SetStopPermanencyTimeM1(uint16_t hTickCount);
bool StopPermanencyTimeHasElapsedM1(void);
void SafetyTask_PWMOFF(uint8_t motor);
void PWMCurrFdbk_IqdMovingAverage(FOCVars_t * pHandle);
bool IsPhaseCableDisconnected(FOCVars_t * pHandle, int16_t MechSpeed);

/**
 * @brief It initializes the whole MC core according to user defined
 *        parameters.
 * @retval None
 */
void MC_BootUp(void)
{
    
    MotorParameters_Init(&MotorParameters);
    
    /**************************************/
    /*    State machine initialization    */
    /**************************************/
    MCStateMachine_Init(&MCStateMachine[M1]);

    bMCBootCompleted = 0;
    pCircleLimitation[M1] = &CircleLimitationM1;
    pFieldWeakening[M1] = &MCConfig; /* only if M1 has FW */
    pFeedforward[M1] = &FeedforwardM1;      /* only if M1 has FF */

    /**********************************************************/
    /*     PWM and current sensing component initialization   */
    /**********************************************************/
    pPWMCurrFdbk[M1] = &PWMInsulCurrSensorFdbkHandleM1.Super;
    PWMInsulCurrSensorFdbk_Init(&PWMInsulCurrSensorFdbkHandleM1);

    /******************************************************/
    /*   PID component initialization: speed regulation   */
    /******************************************************/
    PID_Init(&PIDSpeedHandleM1, MotorParameters.ParametersConversion.PIDInitSpeed);
    pPIDSpeed[M1] = &PIDSpeedHandleM1;

    /******************************************************/
    /*     Main speed sensor component initialization     */
    /******************************************************/
    #if VEHICLE_SELECTION == VEHICLE_QUIETKAT || VEHICLE_SELECTION == VEHICLE_E_CELLS
    //used to update wTorqueSlopePerSecondUp with the correct
    //value, based on the auto master/slave detection.
    if (VcAutodeter_GetGnrState())
    {
        SpeednTorqCtrlM1.wTorqueSlopePerSecondUp = MASTER_DEFAULT_TORQUE_SLOPE_UP;
    }
    else
    {
        SpeednTorqCtrlM1.wTorqueSlopePerSecondUp = SLAVE_DEFAULT_TORQUE_SLOPE_UP;
    }
    #endif
    pSpeedTorqCtrl[M1] = &SpeednTorqCtrlM1;
    HallPosSensor_Init(&HallPosSensorM1, MotorParameters);
    RotorPosObs_Init(&RotorPosObsM1, MotorParameters);

    /******************************************************/
    /*   Speed & torque component initialization          */
    /******************************************************/
    SpdTorqCtrl_Init(pSpeedTorqCtrl[M1], pPIDSpeed[M1], &RotorPosObsM1.Super, &TempSensorControllerM1, &TempSensorMotorM1, MotorParameters);

    /******************************************************/
    /*  Auxiliary speed sensor component initialization   */
    /******************************************************/
    BemfObsPll_Init(&BemfObserverPllM1, MotorParameters);

    /********************************************************/
    /*     PID component initialization: current regulation */
    /********************************************************/
    PID_Init(&PIDIqHandleM1, MotorParameters.ParametersConversion.PIDInitIq);
    PID_Init(&PIDIdHandleM1, MotorParameters.ParametersConversion.PIDInitId);
    pPIDIq[M1] = &PIDIqHandleM1;
    pPIDId[M1] = &PIDIdHandleM1;

    /********************************************************/
    /*     Bus voltage sensor component initialization      */
    /********************************************************/
    pBusSensorM1 = &RealBusVoltageSensorParamsM1;
    ResDivVbusSensor_Init(pBusSensorM1);

    /*************************************************/
    /*   Power measurement component initialization  */
    /*************************************************/
    pMotorPower[M1] = &PQDMotorPowMeasM1;
    pMotorPower[M1]->pVBS = &(pBusSensorM1->Super);
    pMotorPower[M1]->pFOCVars = &FOCVars[M1];

    /*******************************************************/
    /*   Temperature measurement component initialization  */
    /*******************************************************/
    NTCTempSensor_Init(&TempSensorControllerM1, MotorParameters.ParametersConversion.HeatsinkNTCInit, DEFAULT_TEMP_CONTROLLER);
    pTemperatureSensorController[M1] = &TempSensorControllerM1;
    NTCTempSensor_Init(&TempSensorMotorM1, MotorParameters.ParametersConversion.MotorNTCInit, DEFAULT_TEMP_MOTOR);
    pTemperatureSensorMotor[M1] = &TempSensorMotorM1;
    initMotorMixedSignal(MotorParameters);
    /*******************************************************/
    /*     Motor Control component initialization         */
    /*******************************************************/
    PID_Init(&PIDMotorControlM1, MotorParameters.ParametersConversion.PIDInitMotorControl);
    MotorControl_Init(pFieldWeakening[M1], pPIDSpeed[M1], &PIDMotorControlM1, MotorParameters);

    /*******************************************************/
    /*     Feed forward component initialization           */
    /*******************************************************/
    Feedforward_Init(pFeedforward[M1], &(pBusSensorM1->Super), pPIDId[M1], pPIDIq[M1]);

    /*******************************************************/
    /*     MCTuning & FOC variables initialization         */
    /*******************************************************/
    FOC_Clear(M1);
    FOCVars[M1].bDriveInput = INTERNAL;
    oMCInterface[M1] = &MCInterface[M1];
    
    
    MCInterface_Init(oMCInterface[M1], &MCStateMachine[M1], pSpeedTorqCtrl[M1], &FOCVars[M1], pBusSensorM1, &MCConfig);
    
    /* Section where we initialise conversion factors that need to be available to vehicle control */
    oMCInterface[M1]->MCIConvFactors.Gain_Torque_IQRef = MotorParameters.ParametersConversion.fGainTorqueIqRef;
    oMCInterface[M1]->MCIConvFactors.MaxMeasurableCurrent = MAX_MEASURABLE_CURRENT;
    /***********************************************************************************************/
    
    MCTuning[M1].pPIDSpeed = pPIDSpeed[M1];
    MCTuning[M1].pPIDIq = pPIDIq[M1];
    MCTuning[M1].pPIDId = pPIDId[M1];
    MCTuning[M1].pPIDMotorControl = &PIDMotorControlM1; /* only if M1 has FW */
    MCTuning[M1].pPWMnCurrFdbk = pPWMCurrFdbk[M1];
    MCTuning[M1].pSpeedSensorMain = (SpdPosFdbkHandle_t *)&RotorPosObsM1;
    MCTuning[M1].pSpeedSensorAux = (SpdPosFdbkHandle_t *)&BemfObserverPllM1;
    MCTuning[M1].pSpeedSensorVirtual = MC_NULL;
    MCTuning[M1].pSpeednTorqueCtrl = pSpeedTorqCtrl[M1];
    MCTuning[M1].pStateMachine = &MCStateMachine[M1];
    MCTuning[M1].pTemperatureSensorController = (NTCTempSensorHandle_t *)pTemperatureSensorController[M1];
    MCTuning[M1].pTemperatureSensorMotor = (NTCTempSensorHandle_t *)pTemperatureSensorMotor[M1];
    MCTuning[M1].pBusVoltageSensor = &(pBusSensorM1->Super);
    MCTuning[M1].pMotorPower = (MotorPowerMeasHandle_t *)pMotorPower[M1];
    MCTuning[M1].pFieldWeakening = pFieldWeakening[M1];
    MCTuning[M1].pFeedforward = pFeedforward[M1];

    /*******************************************************/
    /*     Dynamic PI lookup table initialization         */
    /*******************************************************/
    LookupTable_Init(&LookupTableM1IqKp);
    LookupTable_Init(&LookupTableM1IqKi);
    LookupTable_Init(&LookupTableM1IdKp);
    LookupTable_Init(&LookupTableM1IdKi);
    
    /*******************************************************/
    /*     Motor tuner initialization         */
    /*******************************************************/
    #if AUTOTUNE_ENABLE
    R_AID_Init(REGULATION_EXECUTION_RATE, 1.0f/(float)SPEED_LOOP_FREQUENCY_HZ);
    R_AID_ConfigEnableVolterrID(); // Enable the voltage error measurement procedure.
    R_AID_ConfigSetVolterrCrntStep(10);       
    pAutoTune.TuningStatus=0;
    pAutoTune.bStartTuning=false;
    pAutoTune.bEnAutotune = MotorParameters.bAutotuneEnable;
    MCTask_InitTuning();
    #endif
    
