tristar-multicopters/MotorControl/src/GNR2_Firmware/revA/grn2_ra6t2_ftexboard/FTEX/src/application_motor/mc_tasks.c
    bMCBootCompleted = 1;
    
    //check for the motor current is larger than the controller current
    if (MotorParameters.ConfigParameters.hPeakCurrentMotorAmps > PEAK_CURRENT_CONTROLLER_amps)
    {
        MCStateMachine_WarningHandling(&MCStateMachine[M1], MC_CURR_LIMIT_CONTROLLER, 0);    //Report the warning
    }
    
}

void MC_RunMotorControlTasks(void)
{
    if (bMCBootCompleted)
    {
        /* ** Medium Frequency Tasks ** */
        MC_Scheduler();
    }
}

void MC_Scheduler(void)
{
    if (bMCBootCompleted == 1)
    {
        if (hMFTaskCounterM1 > 0u)
        {
            hMFTaskCounterM1--;
        }
        else
        {
            //period of execution is 1 ms.
            MediumFrequencyTaskM1();
            hMFTaskCounterM1 = MF_TASK_OCCURENCE_TICKS;
        }
        if (hBootCapDelayCounterM1 > 0u)
        {
            hBootCapDelayCounterM1--;
        }
        if (hStopPermanencyCounterM1 > 0u)
        {
            hStopPermanencyCounterM1--;
        }
    }
    else
    {
    }
}

/**
 * @brief Executes medium frequency periodic Motor Control tasks
 *
 * This function performs some of the control duties on Motor 1 according to the
 * present state of its state machine. In particular, duties requiring a periodic
 * execution at a medium frequency rate (such as the speed controller for instance)
 * are executed here.
 */
void MediumFrequencyTaskM1(void)
{
    MotorState_t StateM1;
    int16_t wAux = 0;
    if (hOCCheckReset < OCD2_CHECK_RESET)
    {
        hOCCheckReset++;
    }
    else
    {
        hOCCheckReset = 0;
        bOCCheck = 0;
        bOCNumOccur = 0;
    }
    
    MCStateMachine_ErrorProcessing(&MCStateMachine[M1]);
    
    #if HSLOG_BUTTON_LOG
    (void) BemfObsPll_CalcAvrgMecSpeedUnit(&BemfObserverPllM1, &wAux);
        
     if (!uCAL_GPIO_Read(REVERSE_GPIO_PIN))
     {
        LogHS_StopLog(&LogHS_handle);
     }
    #endif

   (void)HallPosSensor_CalcAvrgMecSpeedUnit(&HallPosSensorM1, &wAux);
   bool bIsSpeedReliable = RotorPosObs_CalcMecSpeedUnit(&RotorPosObsM1, &wAux);
    MotorPowerQD_CalcElMotorPower(pMotorPower[M1]);
#if DYNAMIC_CURRENT_CONTROL_PID
    FOC_UpdatePIDGains(M1);
#endif

    StateM1 = MCStateMachine_GetState(&MCStateMachine[M1]);
    switch (StateM1)
    {
    case M_IDLE:
#if DEBUGMODE_MOTOR_CONTROL
        if (bStartMotor)
        {
            MCInterface_ExecTorqueRamp(oMCInterface[M1], hTorqueFinalValueTest);
            MCStateMachine_NextState(&MCStateMachine[M1], M_IDLE_START);
        }
#endif
#if AUTOTUNE_ENABLE
        if ((pAutoTune.bEnAutotune == true) && (pAutoTune.bStartTuning == 1))
        {      
            MotorParameters.bAutotuneEnable = false;
            PWMInsulCurrSensorFdbk_TurnOnLowSides(pPWMCurrFdbk[M1]);
            PWMInsulCurrSensorFdbk_SwitchOnPWM(pPWMCurrFdbk[M1]);            
            MCInterface_StartMotorTuning(oMCInterface[M1]);
            PWMInsulCurrSensorFdbkHandleM1.wPhaseAOffset=UINT16_MAX/2;
            PWMInsulCurrSensorFdbkHandleM1.wPhaseBOffset=UINT16_MAX/2;
            pPWMCurrFdbk[M1]->IaFilter.pIIRFAInstance =NULL;
            pPWMCurrFdbk[M1]->IbFilter.pIIRFAInstance =NULL;
        }
 #endif    

        
        //check for whether motor temp is in foldback region
        if (NTCTempSensor_CalcAvTemp(pTemperatureSensorMotor[M1]) == NTC_FOLDBACK)
        {
            MCStateMachine_WarningHandling(&MCStateMachine[M1], MC_FOLDBACK_TEMP_MOTOR, 0);    //Report the warning
        }
        else
        {
            MCStateMachine_WarningHandling(&MCStateMachine[M1], 0, MC_FOLDBACK_TEMP_MOTOR);    //Clear the warning
        }
        
        //check for whether controller temp is in foldback region
        if (NTCTempSensor_CalcAvTemp(pTemperatureSensorController[M1]) == NTC_FOLDBACK)
        {
            MCStateMachine_WarningHandling(&MCStateMachine[M1], MC_FOLDBACK_TEMP_CONTROLLER, 0);    //Report the warning
        }
        else
        {
            MCStateMachine_WarningHandling(&MCStateMachine[M1], 0, MC_FOLDBACK_TEMP_CONTROLLER);    //Clear the warning
        }
        
        //check if NTC is disconnected
        if (NTCTempSensor_CalcAvTemp(pTemperatureSensorMotor[M1]) == NTC_DISC)
        {
            MCStateMachine_WarningHandling(&MCStateMachine[M1], MC_NTC_DISC_FREEZE_MOTOR, 0);  //Report the warning
        }
        else
        {
            MCStateMachine_WarningHandling(&MCStateMachine[M1], 0, MC_NTC_DISC_FREEZE_MOTOR);  //Clear the warning
        }
        break;

    case M_IDLE_START:
        PWMInsulCurrSensorFdbk_TurnOnLowSides(pPWMCurrFdbk[M1]);
        SetChargeBootCapDelayM1(CHARGE_BOOT_CAP_TICKS);
        MCStateMachine_NextState(&MCStateMachine[M1], M_CHARGE_BOOT_CAP);
        break;

    case M_CHARGE_BOOT_CAP:
        if (ChargeBootCapDelayHasElapsedM1())
        {
            MCStateMachine_NextState(&MCStateMachine[M1], M_OFFSET_CALIB);
        }
        break;

    case M_OFFSET_CALIB:
        if (PWMCurrFdbk_CurrentReadingCalibr(pPWMCurrFdbk[M1]))
        {
            MCStateMachine_NextState(&MCStateMachine[M1], M_CLEAR);
        }
        break;

    case M_CLEAR:
        HallPosSensor_Clear(&HallPosSensorM1);
        BemfObsPll_Clear(&BemfObserverPllM1);
        RotorPosObs_Clear(&RotorPosObsM1);
        Clear_MotorStuckReverse(&pSpeedTorqCtrl[M1]->StuckProtection);
        if (MCStateMachine_NextState(&MCStateMachine[M1], M_START) == true)
        {
            FOC_Clear(M1);
            PWMInsulCurrSensorFdbk_SwitchOnPWM(pPWMCurrFdbk[M1]);
        }
        break;

    case M_START:
        MCStateMachine_NextState(&MCStateMachine[M1], M_START_RUN);
        break;

    case M_START_RUN:
        FOC_InitAdditionalMethods(M1);
        FOC_CalcCurrRef(M1);
        Driver_Enable(&MCInterface->bDriverEn);
        MCStateMachine_NextState(&MCStateMachine[M1], M_RUN);
        SpdTorqCtrl_ForceSpeedReferenceToCurrentSpeed(pSpeedTorqCtrl[M1]); /* Init the reference speed to current speed */
        MCInterface_ExecBufferedCommands(oMCInterface[M1]);                /* Exec the speed ramp after changing of the speed sensor */
#if !(BYPASS_POSITION_SENSOR)
        if (Check_MotorStuckReverse(&pSpeedTorqCtrl[M1]->StuckProtection, pSpeedTorqCtrl[M1]->hFinalTorqueRef, 
                                    pSpeedTorqCtrl[M1]->hBusVoltage, pSpeedTorqCtrl[M1]->pSPD->hAvrMecSpeedUnit)
                                    != MC_NO_FAULT)
        {
            MCStateMachine_CriticalFaultProcessing(&MCStateMachine[M1], MC_MSRP, 0);    //Report the Fault and change bstate to FaultNow
        }
#endif
        
