tristar-multicopters/MotorControl/src/GNR2_Firmware/revA/grn2_ra6t2_ftexboard/FTEX/src/application_motor/mc_tasks.c
#if HSLOG_ZEROSPEED_LOG
        LogHS_StartOneShot(&LogHS_handle);
#endif

        break;

    case M_RUN:
#if DEBUGMODE_MOTOR_CONTROL
        if (!bStartMotor)
        {
            MCStateMachine_NextState(&MCStateMachine[M1], M_ANY_STOP);
        }
        MCInterface_ExecTorqueRamp(oMCInterface[M1], hTorqueFinalValueTest);
#endif
        MCInterface_ExecBufferedCommands(oMCInterface[M1]);
        FOC_CalcCurrRef(M1);

        if (IsPhaseCableDisconnected(MCInterface->pFOCVars, MCInterface->pSpeedTorqCtrl->pSPD->hAvrMecSpeedUnit) == true)
        {
            // raise MC_PHASE_DISC error if the ratio of measured Iqd and reference Iq is not reasoble
            MCStateMachine_WarningHandling(&MCStateMachine[M1], MC_PHASE_DISC, 0);    //Report the warning
        }
        else
        {
            MCStateMachine_WarningHandling(&MCStateMachine[M1], 0, MC_PHASE_DISC);    //Clear the warning
        }
        //check for whether motor temp is in foldback region
        if (NTCTempSensor_CalcAvTemp(pTemperatureSensorMotor[M1]) == NTC_FOLDBACK)
        {
            MCStateMachine_WarningHandling(&MCStateMachine[M1], MC_FOLDBACK_TEMP_MOTOR, 0);    //Report the warning
        }
        else
        {
            MCStateMachine_WarningHandling(&MCStateMachine[M1], 0, MC_FOLDBACK_TEMP_MOTOR);    //Clear the warning
        }
        
        //check for whether controller temp is in foldback region
        if (NTCTempSensor_CalcAvTemp(pTemperatureSensorController[M1]) == NTC_FOLDBACK)
        {
            MCStateMachine_WarningHandling(&MCStateMachine[M1], MC_FOLDBACK_TEMP_CONTROLLER, 0);    //Report the warning
        }
        else
        {
            MCStateMachine_WarningHandling(&MCStateMachine[M1], 0, MC_FOLDBACK_TEMP_CONTROLLER);    //Clear the warning
        }
        
        //check if NTC is disconnected
        if (NTCTempSensor_CalcAvTemp(pTemperatureSensorMotor[M1]) == NTC_DISC)
        {
            MCStateMachine_WarningHandling(&MCStateMachine[M1], MC_NTC_DISC_FREEZE_MOTOR, 0);    //Report the warning
        }
        else
        {
            MCStateMachine_WarningHandling(&MCStateMachine[M1], 0, MC_NTC_DISC_FREEZE_MOTOR);    //Clear the warning
        }

#if !(BYPASS_POSITION_SENSOR)    
        if (Check_MotorStuckReverse(&pSpeedTorqCtrl[M1]->StuckProtection, pSpeedTorqCtrl[M1]->hFinalTorqueRef, 
                                    pSpeedTorqCtrl[M1]->hBusVoltage, pSpeedTorqCtrl[M1]->pSPD->hAvrMecSpeedUnit)
                                    != MC_NO_FAULT)  
        { 
            MCStateMachine_CriticalFaultProcessing(&MCStateMachine[M1], MC_MSRP, 0);    //Report the Fault and change bstate to FaultNow
        }            
#endif

#if !(BYPASS_POSITION_SENSOR || BYPASS_CURRENT_CONTROL)
        if (!bIsSpeedReliable)
        {
            //MCStateMachine_CriticalFaultProcessing(&MCStateMachine[M1], MC_SPEED_FDBK, 0);
        }
#endif
        break;

    case M_ANY_STOP:
        PWMInsulCurrSensorFdbk_SwitchOffPWM(pPWMCurrFdbk[M1]);
        if (MCInterface->bDriverEn == true)
        {
            Driver_Disable(&MCInterface->bDriverEn);
        }
        FOC_Clear(M1);
        MotorPowMeas_Clear((MotorPowerMeasHandle_t *)pMotorPower[M1]);
        SetStopPermanencyTimeM1(STOPPERMANENCY_TICKS);

        MCStateMachine_NextState(&MCStateMachine[M1], M_STOP);
        break;

    case M_STOP:
        if (StopPermanencyTimeHasElapsedM1())
        {
            MCStateMachine_NextState(&MCStateMachine[M1], M_STOP_IDLE);
        }
        break;

    case M_STOP_IDLE:
        MCStateMachine_NextState(&MCStateMachine[M1], M_IDLE);
        break;
#if AUTOTUNE_ENABLE
    case M_AUTOTUNE_ENTER_IDENTIFICATION:    
        MC_ConfigureMotorTuner();
    
        R_AID_CmdStart();
        pAutoTune.TuningStatus = TUNING_START;
        MCStateMachine_NextState(&MCStateMachine[M1], M_AUTOTUNE_IDENTIFICATION);
        break;
    
    case M_AUTOTUNE_IDENTIFICATION:
        R_AID_SpeedCtrlISR();
        pAutoTune.TuningStatus = TUNING_IN_PROGRESS;
        MC_UpdateMotorTunerOutput(pAutoTune.MotorTunerInput.DCBusVoltage);
        // Check if the autotune is completed or has an error.
        if (R_AID_GetSystemStatus() == AID_STATUS_COMPLETED || R_AID_GetSystemStatus() == AID_STATUS_ERROR )
        {
            MCInterface_StopMotorTuning(oMCInterface[M1]); // Return to normal motor control mode
            if (R_AID_GetSystemStatus() == AID_STATUS_ERROR)
            {
                pAutoTune.TuningStatus = TUNING_ERROR;
            }
        }
        
        break;
    
    case M_AUTOTUNE_ANY_STOP_IDENTIFICATION:
        R_AID_CmdStop();
        PWMInsulCurrSensorFdbk_SwitchOffPWM(pPWMCurrFdbk[M1]);
        SetStopPermanencyTimeM1(STOPPERMANENCY_TICKS);
        MCStateMachine_NextState(&MCStateMachine[M1], M_AUTOTUNE_STOP_IDENTIFICATION);
        break;
    
    case M_AUTOTUNE_STOP_IDENTIFICATION:
        if (StopPermanencyTimeHasElapsedM1())
        {
            if (pAutoTune.TuningStatus != TUNING_ERROR)
            {
                pAutoTune.TuningStatus = TUNING_DONE;
            }
            pAutoTune.bStartTuning = false;
            pAutoTune.bEnAutotune = false;
            MCStateMachine_NextState(&MCStateMachine[M1], M_IDLE);
        }
        break;
#endif
    default:
        break;
    }
}

/**
 * @brief It re-initializes the current and voltage variables. Moreover
 *        it clears qd currents PI controllers, voltage sensor and SpeednTorque
 *        controller. It must be called before each motor restart.
 *        It does not clear speed sensor.
 * @param  bMotor related motor it can be M1 or M2
 * @retval none
 */
void FOC_Clear(uint8_t bMotor)
{
    ab_t NULL_ab = {(int16_t)0, (int16_t)0};
    qd_t NULL_qd = {(int16_t)0, (int16_t)0};
    AlphaBeta_t NULL_alphabeta = {(int16_t)0, (int16_t)0};

    FOCVars[bMotor].Iab = NULL_ab;
    FOCVars[bMotor].Ialphabeta = NULL_alphabeta;
    FOCVars[bMotor].Iqd = NULL_qd;
    FOCVars[bMotor].Iqdref = NULL_qd;
    FOCVars[bMotor].hTeref = (int16_t)0;
    FOCVars[bMotor].Vqd = NULL_qd;
    FOCVars[bMotor].Valphabeta = NULL_alphabeta;
    FOCVars[bMotor].hElAngle = (int16_t)0;

