tristar-multicopters/MotorControl/src/GNR2_Firmware/revA/grn2_ra6t2_ftexboard/FTEX/src/application_motor/mc_tasks.c
#if AUTOTUNE_ENABLE
/*************************** TUNING ************************************/
/**
  * @brief  This function fills the initiate values to the tuning variables
  */
void MCTask_InitTuning()
{
    pAutoTune.MotorTunerInput.NumPolePairs = 8;
    pAutoTune.MotorTunerInput.RatedMotorCurrent = 30;
    pAutoTune.MotorTunerInput.DCBusVoltage = 48;
}

/**
  * @brief  This function returns the results of the last identification procedure.
  * @param  fBatteryVoltage Rated DC voltage of battery used to operate the motor.
  * @retval True if last identification was successfully completed.
  */
bool MC_UpdateMotorTunerOutput(float fBatteryVoltage)
{
    bool bRetVal = false;
    st_aid_id_setting_t IdentificationSettings;
    
    pAutoTune.MotorTunerOutput.fProgress = R_AID_GetProgress();
    pAutoTune.MotorTunerOutput.hErrorCode = R_AID_GetErrorStatus();
    pAutoTune.MotorTunerOutput.bCompleted = false;
    
    if (R_AID_GetSystemStatus() == AID_STATUS_COMPLETED)
    {        
        pAutoTune.MotorTunerOutput.bCompleted = true;
        
        R_AID_GetIDSetting(&IdentificationSettings);
        //Make a coef to convert PID gains from the autotune library range to match the range expected by our firmware.
        float fScalingKpIq = (float)(fBatteryVoltage/SQRT_3*AMPLIFICATION_GAIN/ADC_REFERENCE_VOLTAGE*PID_GetKPDivisor(pPIDIq[M1]));
        float fScalingKiIq = (float)(fBatteryVoltage/SQRT_3*AMPLIFICATION_GAIN/ADC_REFERENCE_VOLTAGE*PID_GetKIDivisor(pPIDIq[M1]));
        float fScalingKpId = (float)(fBatteryVoltage/SQRT_3*AMPLIFICATION_GAIN/ADC_REFERENCE_VOLTAGE*PID_GetKPDivisor(pPIDId[M1]));
        float fScalingKiId = (float)(fBatteryVoltage/SQRT_3*AMPLIFICATION_GAIN/ADC_REFERENCE_VOLTAGE*PID_GetKIDivisor(pPIDId[M1]));
        
        pAutoTune.MotorTunerOutput.fBatteryVoltage = fBatteryVoltage;
        pAutoTune.MotorTunerOutput.Rs = R_AID_GetResistance();
        pAutoTune.MotorTunerOutput.Ld = R_AID_GetLd();
        pAutoTune.MotorTunerOutput.Lq = R_AID_GetLq();
        pAutoTune.MotorTunerOutput.J = R_AID_GetInertia();
        pAutoTune.MotorTunerOutput.Friction = R_AID_GetFriction();
        pAutoTune.MotorTunerOutput.Ke = R_AID_GetKe();
        pAutoTune.MotorTunerOutput.IqKp = (int16_t) (fScalingKpIq*aid_f4_kp_iq);
        pAutoTune.MotorTunerOutput.IqKi = (int16_t) (fScalingKiIq*aid_f4_ki_iq);
        pAutoTune.MotorTunerOutput.IdKp = (int16_t) (fScalingKpId*aid_f4_kp_id);
        pAutoTune.MotorTunerOutput.IdKi = (int16_t) (fScalingKiId*aid_f4_ki_id);
        pAutoTune.MotorTunerOutput.RatedSpeed =  (int16_t) (fBatteryVoltage/SQRT_3/R_AID_GetKe()/(2*PI_)*_RPM);
        pAutoTune.MotorTunerOutput.RatedTorque = (int16_t) (1.5f*IdentificationSettings.u2_num_pole_pairs*IdentificationSettings.f4_rated_current*R_AID_GetKe()*100.0f);
        bRetVal = true;
    }
    
    return bRetVal;
}

/**
  *  @brief This function configure motor information for tuning
  */
void MC_ConfigureMotorTuner(void)
{   
    R_AID_ConfigMotorPlate(pAutoTune.MotorTunerInput.RatedMotorCurrent, pAutoTune.MotorTunerInput.NumPolePairs);
    R_AID_SetInitElecParams(pAutoTune.MotorTunerInput.KnownRs,
                            pAutoTune.MotorTunerInput.KnownLd,
                            pAutoTune.MotorTunerInput.KnownLq,
                            pAutoTune.MotorTunerInput.KnownMagnetFlux);
}
#endif